---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailExtensionStyle.Floor
enum: Autodesk.Revit.DB.Architecture.RailExtensionStyle
zh: 楼板、板、地板
source: html/04ad8fa3-fd3b-33a5-e19a-75447ec3b1a4.htm
---
# Autodesk.Revit.DB.Architecture.RailExtensionStyle.Floor

**中文**: 楼板、板、地板

The rail extends to floor.